# todo: 10.1 Дано целое число A. Проверить истинность высказывания: «Число A является четным».

A = int(input("Введите целое число А: "))

if A % 2 == 0:
    print("Число A является четным: True")
else:
    print("Число A является четным: False")

# todo: 10.2 Дано целое число A. Проверить истинность высказывания: «Число A является нечетным».

A = int(input("Введите целое число А: "))

if A % 2 == 0:
    print("Число A является нечетным: False")
else:
    print("Число A является нечетным: True")

